renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/4_Platform_driver/OS_Example_Timer/Autosar/Mcal/Base/header/S32K144_M4.svd
        <register>
          <name>OPACRL</name>
          <description>Off-Platform Peripheral Access Control Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP7</name>
              <description>Trusted Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP7_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP7_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP7</name>
              <description>Write Protect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP7_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP7_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP7</name>
              <description>Supervisor Protect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP7_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP7_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP6</name>
              <description>Trusted Protect</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP6_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP6_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP6</name>
              <description>Write Protect</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP6_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP6_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP6</name>
              <description>Supervisor Protect</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP6_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP6_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP5</name>
              <description>Trusted Protect</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP5_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP5_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP5</name>
              <description>Write Protect</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP5_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP5_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP5</name>
              <description>Supervisor Protect</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP5_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP5_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
