renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/4_Platform_driver/OS_Example_Timer/Autosar/Mcal/Base/header/S32K144_M4.svd
        <register>
          <name>CP0CFG3</name>
          <description>Processor 0 Configuration Register 3</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPU</name>
              <description>Floating Point Unit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FPU_0</name>
                  <description>FPU support is not included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPU_1</name>
                  <description>FPU support is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMD</name>
              <description>SIMD/NEON instruction support</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIMD_0</name>
                  <description>SIMD/NEON support is not included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMD_1</name>
                  <description>SIMD/NEON support is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JAZ</name>
              <description>Jazelle support</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JAZ_0</name>
                  <description>Jazelle support is not included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JAZ_1</name>
                  <description>Jazelle support is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMU</name>
              <description>Memory Management Unit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MMU_0</name>
                  <description>MMU support is not included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMU_1</name>
                  <description>MMU support is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZ</name>
              <description>Trust Zone</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TZ_0</name>
                  <description>Trust Zone support is not included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TZ_1</name>
                  <description>Trust Zone support is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>Core Memory Protection unit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMP_0</name>
                  <description>Core Memory Protection is not included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_1</name>
                  <description>Core Memory Protection is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BB</name>
              <description>Bit Banding</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BB_0</name>
                  <description>Bit Banding is not supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BB_1</name>
                  <description>Bit Banding is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBP</name>
              <description>System Bus Ports</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMDR0</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCA089000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCM1</name>
              <description>OCMEM Control Field 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCMPU</name>
              <description>OCMPU</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCMT</name>
              <description>OCMT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMT_4</name>
                  <description>OCMEMn is a Program Flash.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMT_5</name>
                  <description>OCMEMn is a Data Flash.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMT_6</name>
                  <description>OCMEMn is an EEE.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>RO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RO_0</name>
                  <description>Writes to the OCMDRn[11:0] are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RO_1</name>
                  <description>Writes to the OCMDRn[11:0] are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMW</name>
              <description>OCMW</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMW_2</name>
                  <description>OCMEMn 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMW_3</name>
                  <description>OCMEMn 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMW_4</name>
                  <description>OCMEMn 128-bits wide</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMW_5</name>
                  <description>OCMEMn 256-bits wide</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZ</name>
              <description>OCMSZ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMSZ_0</name>
                  <description>no OCMEMn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_1</name>
                  <description>1KB OCMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_2</name>
                  <description>2KB OCMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_3</name>
                  <description>4KB OCMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_4</name>
                  <description>8KB OCMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_5</name>
                  <description>16KB OCMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_6</name>
                  <description>32KB OCMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_7</name>
                  <description>64KB OCMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_8</name>
                  <description>128KB OCMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_9</name>
                  <description>256KB OCMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_10</name>
                  <description>512KB OCMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_11</name>
                  <description>1MB OCMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_12</name>
                  <description>2MB OCMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_13</name>
                  <description>4MB OCMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_14</name>
                  <description>8MB OCMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_15</name>
                  <description>16MB OCMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZH</name>
              <description>OCMSZH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMSZH_0</name>
                  <description>OCMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZH_1</name>
                  <description>OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>V</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_0</name>
                  <description>OCMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1</name>
                  <description>OCMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMDR1</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC706B000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCM1</name>
              <description>OCMEM Control Field 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCMPU</name>
              <description>OCMPU</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCMT</name>
              <description>OCMT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMT_4</name>
                  <description>OCMEMn is a Program Flash.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMT_5</name>
                  <description>OCMEMn is a Data Flash.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMT_6</name>
                  <description>OCMEMn is an EEE.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>RO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RO_0</name>
                  <description>Writes to the OCMDRn[11:0] are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RO_1</name>
                  <description>Writes to the OCMDRn[11:0] are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMW</name>
              <description>OCMW</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMW_2</name>
                  <description>OCMEMn 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMW_3</name>
                  <description>OCMEMn 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMW_4</name>
                  <description>OCMEMn 128-bits wide</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMW_5</name>
                  <description>OCMEMn 256-bits wide</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZ</name>
              <description>OCMSZ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMSZ_0</name>
                  <description>no OCMEMn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_1</name>
                  <description>1KB OCMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_2</name>
                  <description>2KB OCMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_3</name>
                  <description>4KB OCMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_4</name>
                  <description>8KB OCMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_5</name>
                  <description>16KB OCMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_6</name>
                  <description>32KB OCMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_7</name>
                  <description>64KB OCMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_8</name>
                  <description>128KB OCMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_9</name>
                  <description>256KB OCMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_10</name>
                  <description>512KB OCMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_11</name>
                  <description>1MB OCMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_12</name>
                  <description>2MB OCMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_13</name>
                  <description>4MB OCMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_14</name>
                  <description>8MB OCMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZ_15</name>
                  <description>16MB OCMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZH</name>
              <description>OCMSZH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCMSZH_0</name>
                  <description>OCMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCMSZH_1</name>
                  <description>OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>V</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_0</name>
                  <description>OCMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1</name>
                  <description>OCMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
