renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/4_Platform_driver/OS_Example_Timer/Autosar/Mcal/Base/header/S32K144_M4.svd
        <register>
          <name>RGD3_WORD2</name>
          <description>Region Descriptor 3, Word 2</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0UM</name>
              <description>Bus Master 0 User Mode Access Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M0SM</name>
              <description>Bus Master 0 Supervisor Mode Access Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0SM_0</name>
                  <description>r/w/x; read, write and execute allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SM_1</name>
                  <description>r/x; read and execute allowed, but no write</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SM_2</name>
                  <description>r/w; read and write allowed, but no execute</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0SM_3</name>
                  <description>Same as User mode defined in M0UM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M0PE</name>
              <description>Bus Master 0 Process Identifier enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0PE_0</name>
                  <description>Do not include the process identifier in the evaluation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M0PE_1</name>
                  <description>Include the process identifier and mask (RGDn.RGDAAC) in the region hit evaluation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M1UM</name>
              <description>Bus Master 1 User Mode Access Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M1SM</name>
              <description>Bus Master 1 Supervisor Mode Access Control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M1SM_0</name>
                  <description>r/w/x; read, write and execute allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1SM_1</name>
                  <description>r/x; read and execute allowed, but no write</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1SM_2</name>
                  <description>r/w; read and write allowed, but no execute</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1SM_3</name>
                  <description>Same as User mode defined in M1UM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M1PE</name>
              <description>Bus Master 1 Process Identifier enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M1PE_0</name>
                  <description>Do not include the process identifier in the evaluation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1PE_1</name>
                  <description>Include the process identifier and mask (RGDn.RGDAAC) in the region hit evaluation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M2UM</name>
              <description>Bus Master 2 User Mode Access control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M2SM</name>
              <description>Bus Master 2 Supervisor Mode Access Control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2SM_0</name>
                  <description>r/w/x; read, write and execute allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SM_1</name>
                  <description>r/x; read and execute allowed, but no write</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SM_2</name>
                  <description>r/w; read and write allowed, but no execute</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SM_3</name>
                  <description>Same as User mode defined in M2UM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M3UM</name>
              <description>Bus Master 3 User Mode Access Control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M3SM</name>
              <description>Bus Master 3 Supervisor Mode Access Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M3SM_0</name>
                  <description>r/w/x; read, write and execute allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3SM_1</name>
                  <description>r/x; read and execute allowed, but no write</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3SM_2</name>
                  <description>r/w; read and write allowed, but no execute</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3SM_3</name>
                  <description>Same as User mode defined in M3UM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4WE</name>
              <description>Bus Master 4 Write Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4WE_0</name>
                  <description>Bus master 4 writes terminate with an access error and the write is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4WE_1</name>
                  <description>Bus master 4 writes allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4RE</name>
              <description>Bus Master 4 Read Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4RE_0</name>
                  <description>Bus master 4 reads terminate with an access error and the read is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4RE_1</name>
                  <description>Bus master 4 reads allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M5WE</name>
              <description>Bus Master 5 Write Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M5WE_0</name>
                  <description>Bus master 5 writes terminate with an access error and the write is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5WE_1</name>
                  <description>Bus master 5 writes allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M5RE</name>
              <description>Bus Master 5 Read Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M5RE_0</name>
                  <description>Bus master 5 reads terminate with an access error and the read is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5RE_1</name>
                  <description>Bus master 5 reads allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M6WE</name>
              <description>Bus Master 6 Write Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M6WE_0</name>
                  <description>Bus master 6 writes terminate with an access error and the write is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6WE_1</name>
                  <description>Bus master 6 writes allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M6RE</name>
              <description>Bus Master 6 Read Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M6RE_0</name>
                  <description>Bus master 6 reads terminate with an access error and the read is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6RE_1</name>
                  <description>Bus master 6 reads allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7WE</name>
              <description>Bus Master 7 Write Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7WE_0</name>
                  <description>Bus master 7 writes terminate with an access error and the write is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7WE_1</name>
                  <description>Bus master 7 writes allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7RE</name>
              <description>Bus Master 7 Read Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7RE_0</name>
                  <description>Bus master 7 reads terminate with an access error and the read is not performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7RE_1</name>
                  <description>Bus master 7 reads allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RGD3_WORD3</name>
          <description>Region Descriptor 3, Word 3</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLD_0</name>
                  <description>Region descriptor is invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLD_1</name>
                  <description>Region descriptor is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDMASK</name>
              <description>Process Identifier Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>Process Identifier</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RGD4_WORD0</name>
          <description>Region Descriptor 4, Word 0</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRTADDR</name>
              <description>Start Address</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RGD4_WORD1</name>
          <description>Region Descriptor 4, Word 1</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENDADDR</name>
              <description>End Address</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
