renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/4_Platform_driver/OS_Example_Timer/Autosar/Mcal/Base/header/S32K144_M4.svd
        <register>
          <name>FIRCCSR</name>
          <description>Fast IRC Control Status Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIRCEN</name>
              <description>Fast IRC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCEN_0</name>
                  <description>Fast IRC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCEN_1</name>
                  <description>Fast IRC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCREGOFF</name>
              <description>Fast IRC Regulator Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCREGOFF_0</name>
                  <description>Fast IRC Regulator is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCREGOFF_1</name>
                  <description>Fast IRC Regulator is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LK_0</name>
                  <description>Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LK_1</name>
                  <description>Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCVLD</name>
              <description>Fast IRC Valid status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCVLD_0</name>
                  <description>Fast IRC is not enabled or clock is not valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCVLD_1</name>
                  <description>Fast IRC is enabled and output clock is valid. The clock is valid once there is an output clock from the FIRC analog.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCSEL</name>
              <description>Fast IRC Selected status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCSEL_0</name>
                  <description>Fast IRC is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCSEL_1</name>
                  <description>Fast IRC is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIRCDIV</name>
          <description>Fast IRC Divide Register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIRCDIV1</name>
              <description>Fast IRC Clock Divide 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCDIV1_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV1_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRCDIV2</name>
              <description>Fast IRC Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRCDIV2_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRCDIV2_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIRCCFG</name>
          <description>Fast IRC Configuration Register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Frequency Range</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE_0</name>
                  <description>Fast IRC is trimmed to 48 MHz</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLCSR</name>
          <description>System PLL Control Status Register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPLLEN</name>
              <description>System PLL Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLEN_0</name>
                  <description>System PLL is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLEN_1</name>
                  <description>System PLL is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLLCM</name>
              <description>System PLL Clock Monitor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLCM_0</name>
                  <description>System PLL Clock Monitor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLCM_1</name>
                  <description>System PLL Clock Monitor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLLCMRE</name>
              <description>System PLL Clock Monitor Reset Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLCMRE_0</name>
                  <description>Clock Monitor generates interrupt when error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLCMRE_1</name>
                  <description>Clock Monitor generates reset when error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LK_0</name>
                  <description>Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LK_1</name>
                  <description>Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLLVLD</name>
              <description>System PLL Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLVLD_0</name>
                  <description>System PLL is not enabled or clock is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLVLD_1</name>
                  <description>System PLL is enabled and output clock is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLLSEL</name>
              <description>System PLL Selected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLSEL_0</name>
                  <description>System PLL is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLSEL_1</name>
                  <description>System PLL is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLLERR</name>
              <description>System PLL Clock Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLERR_0</name>
                  <description>System PLL Clock Monitor is disabled or has not detected an error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLERR_1</name>
                  <description>System PLL Clock Monitor is enabled and detected an error. System PLL Clock Error flag will not set when System OSC is selected as its source and SOSCERR has set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLDIV</name>
          <description>System PLL Divide Register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPLLDIV1</name>
              <description>System PLL Clock Divide 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLDIV1_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV1_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLLDIV2</name>
              <description>System PLL Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLLDIV2_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLLDIV2_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLCFG</name>
          <description>System PLL Configuration Register</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREDIV</name>
              <description>PLL Reference Clock Divider</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT</name>
              <description>System PLL Multiplier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
