renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/4_Platform_driver/OS_Example_Timer/Autosar/Mcal/Base/header/S32K144_M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PTA</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x400FF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PDOR</name>
          <description>Port Data Output Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDO</name>
              <description>Port Data Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSOR</name>
          <description>Port Set Output Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTSO</name>
              <description>Port Set Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCOR</name>
          <description>Port Clear Output Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTCO</name>
              <description>Port Clear Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTOR</name>
          <description>Port Toggle Output Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTTO</name>
              <description>Port Toggle Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDIR</name>
          <description>Port Data Input Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDI</name>
              <description>Port Data Input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDDR</name>
          <description>Port Data Direction Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDD</name>
              <description>Port Data Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR</name>
          <description>Port Input Disable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID</name>
              <description>Port Input Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PTA">
      <name>PTB</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x400FF040</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PTA">
      <name>PTC</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x400FF080</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PTA">
      <name>PTD</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x400FF0C0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PTA">
      <name>PTE</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x400FF100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>MCM</name>
      <description>Core Platform Miscellaneous Control Module</description>
      <groupName>MCM</groupName>
      <prependToName>MCM_</prependToName>
      <baseAddress>0xE0080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4A8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PLASC</name>
          <description>Crossbar Switch (AXBS) Slave Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ASC</name>
              <description>Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch's slave input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASC_0</name>
                  <description>A bus slave connection to AXBS input port n is absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASC_1</name>
                  <description>A bus slave connection to AXBS input port n is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAMC</name>
          <description>Crossbar Switch (AXBS) Master Configuration</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>AMC</name>
              <description>Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMC_0</name>
                  <description>A bus master connection to AXBS input port n is absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMC_1</name>
                  <description>A bus master connection to AXBS input port n is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPCR</name>
          <description>Core Platform Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFAF</resetMask>
          <fields>
            <field>
              <name>HLT_FSM_ST</name>
              <description>AXBS Halt State Machine Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HLT_FSM_ST_0</name>
                  <description>Waiting for request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLT_FSM_ST_1</name>
                  <description>Waiting for platform idle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLT_FSM_ST_2</name>
                  <description>Unused state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLT_FSM_ST_3</name>
                  <description>Platform stalled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_HLT_REQ</name>
              <description>AXBS Halt Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_HLT_REQ_0</name>
                  <description>AXBS is not receiving halt request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_HLT_REQ_1</name>
                  <description>AXBS is receiving halt request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_HLTD</name>
              <description>AXBS Halted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_HLTD_0</name>
                  <description>AXBS is not currently halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_HLTD_1</name>
                  <description>AXBS is currently halted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMC_PF_IDLE</name>
              <description>Flash Memory Controller Program Flash Idle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FMC_PF_IDLE_0</name>
                  <description>FMC program flash is not idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMC_PF_IDLE_1</name>
                  <description>FMC program flash is currently idle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBRIDGE_IDLE</name>
              <description>Peripheral Bridge Idle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PBRIDGE_IDLE_0</name>
                  <description>PBRIDGE is not idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBRIDGE_IDLE_1</name>
                  <description>PBRIDGE is currently idle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBRR</name>
              <description>Crossbar Round-robin Arbitration Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBRR_0</name>
                  <description>Fixed-priority arbitration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBRR_1</name>
                  <description>Round-robin arbitration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMUAP</name>
              <description>SRAM_U Arbitration Priority</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAMUAP_0</name>
                  <description>Round robin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMUAP_1</name>
                  <description>Special round robin (favors SRAM backdoor accesses over the processor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMUAP_2</name>
                  <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMUAP_3</name>
                  <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMUWP</name>
              <description>SRAM_U Write Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMLAP</name>
              <description>SRAM_L Arbitration Priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAMLAP_0</name>
                  <description>Round robin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMLAP_1</name>
                  <description>Special round robin (favors SRAM backdoor accesses over the processor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMLAP_2</name>
                  <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMLAP_3</name>
                  <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMLWP</name>
              <description>SRAM_L Write Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
